#Использовать asserts
#Использовать "../src"

// BSLLS:UnusedParameters-off
Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
// BSLLS:UnusedParameters-on
	МассивТестов = Новый Массив;
	МассивТестов.Добавить("ТестДолжен_ПредставлениеКодаСостоянияHTTP");
	МассивТестов.Добавить("ТестДолжен_ПредставлениеНеизвестногоКодаСостоянияHTTP");

	Возврат МассивТестов;

КонецФункции

Процедура ТестДолжен_ПредставлениеКодаСостоянияHTTP() Экспорт

	Ожидаем.Что(КодыСостоянияHTTP.Представление(400)).Равно("400: Bad Request");

КонецПроцедуры

Процедура ТестДолжен_ПредставлениеНеизвестногоКодаСостоянияHTTP() Экспорт

	Ожидаем.Что(КодыСостоянияHTTP.Представление(488)).Равно("488: Неизвестный код состояния HTTP");

КонецПроцедуры
