#Использовать asserts
#Использовать "../src"

Функция ЗаголовкиВСтроку(Заголовки)
	
	Строки = Новый Массив;
	РазделительСтрок = Символы.ПС;
	Для Каждого Заголовок Из Заголовки Цикл
		Строки.Добавить(СтрШаблон("%1: %2", Заголовок.Ключ, Заголовок.Значение));
	КонецЦикла;
	Строки.Добавить(РазделительСтрок);
	
	Возврат СтрСоединить(Строки, РазделительСтрок);
	
КонецФункции

Функция ПолучитьСписокТестов(МенеджерТестирования) Экспорт
	
	МассивТестов = Новый Массив;
	МассивТестов.Добавить("ТестДолжен_ПроверитьЧтоРаботаетРазборURLСоЗнакомРавноВЗначенииПараметраЗапроса");
	МассивТестов.Добавить("ТестДолжен_ПроверитьЧтоРаботаетРазборURLСПараметромЗапросаБезЗначения");
	
	Возврат МассивТестов;

КонецФункции

Процедура ТестДолжен_ПроверитьЧтоРаботаетРазборURLСоЗнакомРавноВЗначенииПараметраЗапроса() Экспорт

	СтруктураURL = КоннекторHTTP.РазобратьURL(
		"https://httpbin.org/anything?jql=worklogDate >= 2017-04-01 AND worklogDate <= 2017-05-01&j&i=2");

	Ожидаем.Что(СтруктураURL.Схема).Равно("https");
	Ожидаем.Что(СтруктураURL.Сервер).Равно("httpbin.org");
	Ожидаем.Что(СтруктураURL.Путь).Равно("/anything");
	Ожидаем.Что(СтруктураURL.Порт).Равно(0);
	Ожидаем.Что(СтруктураURL.Фрагмент).Равно("");
	Ожидаем.Что(СтруктураURL.Аутентификация.Пользователь).Равно("");
	Ожидаем.Что(СтруктураURL.Аутентификация.Пароль).Равно("");
	Ожидаем.Что(СтруктураURL.ПараметрыЗапроса["jql"]).Равно("worklogDate >= 2017-04-01 AND worklogDate <= 2017-05-01");
	Ожидаем.Что(СтруктураURL.ПараметрыЗапроса["j"]).Равно(Неопределено);
	Ожидаем.Что(СтруктураURL.ПараметрыЗапроса["i"]).Равно("2");

КонецПроцедуры

Процедура ТестДолжен_ПроверитьЧтоРаботаетРазборURLСПараметромЗапросаБезЗначения() Экспорт

	СтруктураURL = КоннекторHTTP.РазобратьURL("https://httpbin.org/get?key");

	Ожидаем.Что(СтруктураURL.Схема).Равно("https");
	Ожидаем.Что(СтруктураURL.Сервер).Равно("httpbin.org");
	Ожидаем.Что(СтруктураURL.Путь).Равно("/get");
	Ожидаем.Что(СтруктураURL.Порт).Равно(0);
	Ожидаем.Что(СтруктураURL.Фрагмент).Равно("");
	Ожидаем.Что(СтруктураURL.Аутентификация.Пользователь).Равно("");
	Ожидаем.Что(СтруктураURL.Аутентификация.Пароль).Равно("");
	Ожидаем.Что(СтруктураURL.ПараметрыЗапроса["key"]).Равно(Неопределено);

КонецПроцедуры
